trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
/*
 * This file is part of the Trezor project, https://trezor.io/
 *
 * Copyright (c) SatoshiLabs
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifdef KERNEL_MODE
#include <stdint.h>
#include <string.h>

#include <trezor_bsp.h>
#include <trezor_model.h>
#include <trezor_rtl.h>

#include <io/ble.h>
#include <io/nrf.h>
#include <io/tsqueue.h>
#include <sec/backup_ram.h>
#include <sec/unit_properties.h>
#include <sys/irq.h>
#include <sys/sysevent_source.h>
#include <sys/systick.h>
#include <sys/systimer.h>

#ifdef USE_POWER_MANAGER
#include <io/power_manager.h>
#endif

#include "ble_comm_defs.h"

// changing value of TX_QUEUE_LEN is not allowed
// as it might result in order of messages being changed
#define TX_QUEUE_LEN 1
#define EVENT_QUEUE_LEN 4
#define RX_QUEUE_LEN 16
#define LOOP_PERIOD_MS 20
#define PING_PERIOD 100

#define BLE_DATA_HEADER_SIZE 7
#define BLE_DATA_SIZE (BLE_RX_PACKET_SIZE + BLE_DATA_HEADER_SIZE)

typedef struct {
  uint8_t version;
  bool enabled;
} ble_recovery_data_t;

typedef struct {
  ble_mode_t mode_requested;
  ble_mode_t mode_current;
  bool connected;
  bt_le_addr_t connected_addr;
  uint8_t peer_count;
  bool initialized;
  bool enabled;
  bool status_valid;
  bool accept_msgs;
  bool reboot_on_resume;
  bool restart_adv_on_disconnect;
  bool next_adv_with_disconnect;  // next advertising will be started with
                                  // forced disconnect flag
  uint8_t busy_flag;
  bool pairing_allowed;
  bool pairing_requested;
  ble_event_t event_queue_buffers[EVENT_QUEUE_LEN];
  tsqueue_entry_t event_queue_entries[EVENT_QUEUE_LEN];
  tsqueue_t event_queue;

  uint8_t rx_queue_buffers[RX_QUEUE_LEN][BLE_DATA_SIZE];
  tsqueue_entry_t rx_queue_entries[RX_QUEUE_LEN];
  tsqueue_t rx_queue;

  uint8_t tx_queue_buffers[TX_QUEUE_LEN][BLE_DATA_SIZE];
  tsqueue_entry_t ts_queue_entries[TX_QUEUE_LEN];
  tsqueue_t tx_queue;

  uint8_t adv_name[BLE_ADV_NAME_LEN];
  bool static_mac;
  bt_le_addr_t mac;
  bool mac_ready;
  bool high_speed;
  ble_tx_power_level_t power_level;

  uint8_t bond_count;
  bt_le_addr_t bonds[BLE_MAX_BONDS];
  bool bonds_ready;

  bool result;
  bool result_ready;

  systimer_t *timer;
  uint16_t ping_cntr;

#ifdef USE_POWER_MANAGER
  uint8_t soc;
  bool soc_send;
#endif

} ble_driver_t;

static ble_driver_t g_ble_driver = {0};

static const syshandle_vmt_t ble_handle_vmt;
static const syshandle_vmt_t ble_iface_handle_vmt;

static void ble_pairing_end(ble_driver_t *drv) {
  drv->pairing_allowed = false;
  drv->pairing_requested = false;
  drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
}

static bool ble_send_state_request(ble_driver_t *drv) {
  (void)drv;
  uint8_t cmd = INTERNAL_CMD_SEND_STATE;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_advertising_on(ble_driver_t *drv, bool whitelist) {
  (void)drv;

  unit_properties_t props;
  unit_properties_get(&props);

  cmd_advertising_on_t data = {
      .cmd_id = INTERNAL_CMD_ADVERTISING_ON,
      .flags.whitelist = whitelist ? 1 : 0,
      .flags.user_disconnect = drv->next_adv_with_disconnect ? 1 : 0,
      .flags.reserved = 0,
      .color = props.color,
      .static_addr = drv->static_mac,
      .device_code = MODEL_BLE_CODE,
  };

  drv->next_adv_with_disconnect = false;

  memcpy(data.name, drv->adv_name, BLE_ADV_NAME_LEN);

  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, (uint8_t *)&data, sizeof(data),
                      NULL, NULL) >= 0;
}

static bool ble_send_speed_request(ble_driver_t *drv, bool high_speed) {
  (void)drv;
  uint8_t cmd =
      high_speed ? INTERNAL_CMD_SET_SPEED_HIGH : INTERNAL_CMD_SET_SPEED_LOW;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_power_level_request(ble_driver_t *drv,
                                         ble_tx_power_level_t power_level) {
  (void)drv;
  uint8_t cmd[2] = {INTERNAL_CMD_SET_TX_POWER, (uint8_t)power_level};
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_advertising_off(ble_driver_t *drv) {
  (void)drv;
  uint8_t cmd = INTERNAL_CMD_ADVERTISING_OFF;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_erase_bonds(ble_driver_t *drv) {
  (void)drv;
  uint8_t cmd = INTERNAL_CMD_ERASE_BONDS;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_disconnect(ble_driver_t *drv) {
  (void)drv;
  uint8_t cmd = INTERNAL_CMD_DISCONNECT;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_pairing_reject(ble_driver_t *drv) {
  uint8_t cmd = INTERNAL_CMD_REJECT_PAIRING;
  bool result =
      nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL);

  if (result) {
    ble_pairing_end(drv);
  }

  return result;
}

static bool ble_send_pairing_accept(ble_driver_t *drv, uint8_t *code) {
  cmd_allow_pairing_t data = {
      .cmd_id = INTERNAL_CMD_ALLOW_PAIRING,
  };

  memcpy(data.code, code, sizeof(data.code));

  bool result = nrf_send_msg(NRF_SERVICE_BLE_MANAGER, (uint8_t *)&data,
                             sizeof(data), NULL, NULL);

  if (result) {
    ble_pairing_end(drv);
  }

  return result;
}

static bool ble_send_mac_request(ble_driver_t *drv) {
  UNUSED(drv);
  uint8_t cmd = INTERNAL_CMD_GET_MAC;

  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL);
}

static bool ble_send_bond_list_request(ble_driver_t *drv) {
  UNUSED(drv);
  uint8_t cmd = INTERNAL_CMD_GET_BOND_LIST;

  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL);
}
#ifdef USE_POWER_MANAGER
static bool ble_send_battery_update(uint8_t level) {
  uint8_t cmd[2] = {INTERNAL_CMD_BATTERY_UPDATE, level};

  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, cmd, sizeof(cmd), NULL, NULL);
}
#endif

static void ble_process_rx_msg_status(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  event_status_msg_t msg = {0};
  memcpy(&msg, data, MIN(sizeof(event_status_msg_t), len));

  if (!drv->status_valid && msg.connected &&
      drv->mode_requested == BLE_MODE_OFF) {
    drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
  }

  if (drv->connected != msg.connected) {
    if (msg.connected) {
      // new connection

      ble_event_t event = {.type = BLE_CONNECTED};
      tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event),
                      NULL);

