trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  nrf_unregister_listener(NRF_SERVICE_BLE);
  nrf_unregister_listener(NRF_SERVICE_BLE_MANAGER);

  systimer_delete(drv->timer);

  tsqueue_reset(&drv->event_queue);
  tsqueue_reset(&drv->rx_queue);
  tsqueue_reset(&drv->tx_queue);
}

void ble_deinit(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (drv->initialized) {
    ble_deinit_common(drv);
    nrf_deinit();
    drv->initialized = false;
  }
}

void ble_suspend(ble_wakeup_params_t *wakeup_params) {
  ble_driver_t *drv = &g_ble_driver;

  memset(wakeup_params, 0, sizeof(ble_wakeup_params_t));

  if (drv->initialized) {
    bool connected = drv->connected;
    wakeup_params->accept_msgs = drv->accept_msgs;
    wakeup_params->mode_requested = drv->mode_requested;
    wakeup_params->peer_count = drv->peer_count;
    wakeup_params->high_speed = drv->high_speed;
    wakeup_params->next_adv_with_disconnect = drv->next_adv_with_disconnect;
    wakeup_params->restart_adv_on_disconnect = drv->restart_adv_on_disconnect;
    wakeup_params->static_mac = drv->static_mac;
    wakeup_params->enabled = drv->enabled;
    memcpy(wakeup_params->name, drv->adv_name, sizeof(drv->adv_name));
    ble_deinit_common(drv);

    if (!connected) {
      wakeup_params->reboot_on_resume = true;
      // if not connected, we can turn off the radio
      nrf_system_off();
      nrf_deinit();
    } else {
      irq_key_t key = irq_lock();
      memcpy(&wakeup_params->connected_addr, &drv->connected_addr,
             sizeof(drv->connected_addr));
      irq_unlock(key);
      nrf_suspend();
    }

    drv->initialized = false;
  }
}

bool ble_resume(const ble_wakeup_params_t *wakeup_params) {
  ble_driver_t *drv = &g_ble_driver;

  if (!ble_init()) {
    return false;
  }

  if (wakeup_params->reboot_on_resume) {
    nrf_reboot();
  } else {
    nrf_resume();
  }

  irq_key_t key = irq_lock();

  drv->peer_count = wakeup_params->peer_count;
  drv->high_speed = wakeup_params->high_speed;
  drv->static_mac = wakeup_params->static_mac;
  drv->enabled = wakeup_params->enabled;

  memcpy(&drv->connected_addr, &wakeup_params->connected_addr,
         sizeof(drv->connected_addr));
  memcpy(drv->adv_name, wakeup_params->name, sizeof(drv->adv_name));
  drv->mode_requested = wakeup_params->mode_requested;
  drv->next_adv_with_disconnect = wakeup_params->next_adv_with_disconnect;
  drv->restart_adv_on_disconnect = wakeup_params->restart_adv_on_disconnect;

  irq_unlock(key);

  if (wakeup_params->accept_msgs) {
    ble_start();
  }

  return true;
}

bool ble_connected(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool connected = drv->connected && nrf_is_running();

  irq_unlock(key);

  return connected;
}

void ble_start(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  drv->accept_msgs = true;

  irq_unlock(key);
}

void ble_stop(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  drv->accept_msgs = false;
  tsqueue_reset(&drv->rx_queue);

  irq_unlock(key);
}

bool ble_can_write(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  if (!drv->connected || !drv->accept_msgs || !drv->enabled) {
    irq_unlock(key);
    return false;
  }

  bool full = !tsqueue_full(&drv->tx_queue);

  irq_unlock(key);

  return full;
}

bool ble_write(const uint8_t *data, uint16_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  if (!drv->connected || !drv->accept_msgs || !drv->enabled) {
    irq_unlock(key);
    return false;
  }

  uint8_t tx_buf[BLE_DATA_SIZE];
  tx_buf[0] = drv->connected_addr.type;
  memcpy(&tx_buf[1], drv->connected_addr.addr,
         sizeof(drv->connected_addr.addr));
  memcpy(&tx_buf[BLE_DATA_HEADER_SIZE], data,
         MIN(len, BLE_DATA_SIZE - BLE_DATA_HEADER_SIZE));

  bool sent = nrf_send_msg(NRF_SERVICE_BLE, tx_buf, len + BLE_DATA_HEADER_SIZE,
                           NULL, NULL);

  if (!sent) {
    bool queued = tsqueue_enqueue(&drv->tx_queue, tx_buf,
                                  len + BLE_DATA_HEADER_SIZE, NULL);
    irq_unlock(key);
    return queued;
  }

  irq_unlock(key);
  return true;
}

bool ble_can_read(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = !tsqueue_empty(&drv->rx_queue);

  irq_unlock(key);

  return result;
}

uint32_t ble_read(uint8_t *data, uint16_t max_len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return 0;
  }

  irq_key_t key = irq_lock();

  tsqueue_t *queue = &drv->rx_queue;

  uint16_t read_len = 0;

  uint8_t rx_data[BLE_DATA_SIZE];

  tsqueue_dequeue(queue, rx_data, sizeof(rx_data), &read_len, NULL);

  if (read_len != BLE_DATA_SIZE ||
      max_len < (read_len - BLE_DATA_HEADER_SIZE)) {
    irq_unlock(key);
    return 0;
  }

  // first 7 bytes is MAC, ignore for now
  memcpy(data, &rx_data[BLE_DATA_HEADER_SIZE], BLE_RX_PACKET_SIZE);

  irq_unlock(key);

  return BLE_RX_PACKET_SIZE;
}

bool ble_switch_off(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  drv->restart_adv_on_disconnect = false;
  drv->mode_requested = BLE_MODE_OFF;

  irq_unlock(key);

  return true;
}

bool ble_switch_on(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized || !drv->enabled) {
    return false;
  }

  irq_key_t key = irq_lock();

  drv->restart_adv_on_disconnect = true;
  if (drv->connected) {
    drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
  } else {
    drv->mode_requested = BLE_MODE_CONNECTABLE;
  }

  irq_unlock(key);

  return true;
}

bool ble_set_static_mac(bool static_mac) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  drv->static_mac = static_mac;

  irq_unlock(key);

