trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  return true;
}

static void ble_event_flush(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  tsqueue_reset(&drv->event_queue);

  irq_unlock(key);
}

bool ble_enter_pairing_mode(const uint8_t *name, size_t name_len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized || !drv->enabled) {
    return false;
  }

  irq_key_t key = irq_lock();

  if (name != NULL && name_len > 0 && name_len <= BLE_ADV_NAME_LEN) {
    memset(drv->adv_name, 0, sizeof(drv->adv_name));
    memcpy(drv->adv_name, name, name_len);
  } else if (name != NULL && name_len > BLE_ADV_NAME_LEN) {
    return false;
  }

  drv->restart_adv_on_disconnect = true;
  bool connected = drv->connected;

  irq_unlock(key);

  uint16_t retry_cnt = 0;

  while (connected) {
    retry_cnt++;
    if (retry_cnt > 10) {
      // too many retries, give up
      return false;
    }

    ble_send_disconnect(drv);

    systick_delay_ms(20);  // wait for disconnect to complete

    key = irq_lock();
    connected = drv->connected;
    irq_unlock(key);
  }

  ble_event_flush();

  key = irq_lock();

  drv->mode_requested = BLE_MODE_PAIRING;

  irq_unlock(key);

  return true;
}

bool ble_disconnect(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  if (drv->connected && drv->restart_adv_on_disconnect) {
    drv->next_adv_with_disconnect = true;
  }

  bool result = ble_send_disconnect(drv);

  irq_unlock(key);

  return result;
}

bool ble_erase_bonds(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();
  bool result = ble_send_erase_bonds(drv);
  irq_unlock(key);

  return result;
}

bool ble_allow_pairing(const uint8_t *pairing_code) {
  if (pairing_code == NULL) {
    return false;
  }

  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();
  bool result = ble_send_pairing_accept(drv, (uint8_t *)pairing_code);
  irq_unlock(key);

  return result;
}

bool ble_reject_pairing(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();
  bool result = ble_send_pairing_reject(drv);
  irq_unlock(key);

  return result;
}

bool ble_keep_connection(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  drv->restart_adv_on_disconnect = false;
  if (drv->connected) {
    drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
  } else {
    drv->mode_requested = BLE_MODE_OFF;
  }

  irq_unlock(key);

  return true;
}

void ble_set_name(const uint8_t *name, size_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  if (len > BLE_ADV_NAME_LEN) {
    return;
  }

  irq_key_t key = irq_lock();

  memset(drv->adv_name, 0, sizeof(drv->adv_name));
  memcpy(drv->adv_name, name, MIN(len, sizeof(drv->adv_name)));

  if (drv->mode_requested == BLE_MODE_CONNECTABLE) {
    ble_send_advertising_on(drv, true);
  }

  if (drv->mode_requested == BLE_MODE_PAIRING) {
    ble_send_advertising_on(drv, false);
  }

  irq_unlock(key);
}

bool ble_get_event(ble_event_t *event) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = tsqueue_dequeue(&drv->event_queue, (uint8_t *)event,
                                sizeof(*event), NULL, NULL);

  irq_unlock(key);

  return result;
}

void ble_get_state(ble_state_t *state) {
  const ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    memset(state, 0, sizeof(ble_state_t));
    return;
  }

  irq_key_t key = irq_lock();

  state->connected = drv->connected;
  state->peer_count = drv->peer_count;
  state->pairing = drv->mode_current == BLE_MODE_PAIRING;
  state->connectable = drv->mode_current == BLE_MODE_CONNECTABLE;
  state->pairing_requested = drv->pairing_requested;
  state->state_known = drv->status_valid;
  memcpy(&state->connected_addr, &drv->connected_addr,
         sizeof(drv->connected_addr));

  irq_unlock(key);
}

bool ble_get_mac(bt_le_addr_t *mac) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    memset(mac, 0, sizeof(*mac));
    return false;
  }

  drv->mac_ready = false;

  if (!ble_send_mac_request(drv)) {
    return false;
  }

  uint32_t timeout = ticks_timeout(100);

  while (!ticks_expired(timeout)) {
    irq_key_t key = irq_lock();
    if (drv->mac_ready) {
      memcpy(mac, &drv->mac, sizeof(drv->mac));
      irq_unlock(key);
      return true;
    }
    irq_unlock(key);
  }

  memset(mac, 0, sizeof(*mac));
  return false;
}

uint8_t ble_get_bond_list(bt_le_addr_t *bonds, size_t count) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized || count < BLE_MAX_BONDS) {
    memset(bonds, 0, count * sizeof(bt_le_addr_t));
    return 0;
  }

  drv->bonds_ready = false;

  if (!ble_send_bond_list_request(drv)) {
    return 0;
  }

  uint32_t timeout = ticks_timeout(100);

  while (!ticks_expired(timeout)) {
    irq_key_t key = irq_lock();
    if (drv->bonds_ready) {
      memcpy(bonds, &drv->bonds, sizeof(drv->bonds));
      irq_unlock(key);
      return drv->bond_count;
    }
    irq_unlock(key);
  }

  memset(bonds, 0, count * sizeof(bt_le_addr_t));
  return 0;
}

void ble_get_advertising_name(char *name, size_t max_len) {
  ble_driver_t *drv = &g_ble_driver;

  if (max_len < sizeof(drv->adv_name)) {
    memset(name, 0, max_len);
    return;
  }

  if (!drv->initialized) {
    memset(name, 0, max_len);
    return;
  }

  memcpy(name, drv->adv_name, sizeof(drv->adv_name));
}

bool ble_unpair(const bt_le_addr_t *addr) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();
  drv->result_ready = false;
  irq_unlock(key);

  bool result;
  if (addr == NULL) {
    uint8_t cmd = INTERNAL_CMD_UNPAIR;
    result = nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL,
                          NULL) >= 0;
  } else {
    uint8_t data[1 + sizeof(bt_le_addr_t)] = {0};
    data[0] = INTERNAL_CMD_UNPAIR;
    memcpy(&data[1], addr, sizeof(bt_le_addr_t));
    result = nrf_send_msg(NRF_SERVICE_BLE_MANAGER, data, sizeof(data), NULL,
                          NULL) >= 0;
  }

  if (!result) {
    return false;
  }

