trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  result = false;

  uint32_t timeout = ticks_timeout(100);
  while (!ticks_expired(timeout)) {
    key = irq_lock();
    if (drv->result_ready) {
      result = drv->result;
      irq_unlock(key);
      return result;
    }
    irq_unlock(key);
  }

  return result;
}

void ble_set_high_speed(bool enable) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();
  drv->high_speed = enable;
  irq_unlock(key);
}

void ble_set_tx_power(ble_tx_power_level_t level) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();
  drv->power_level = level;
  irq_unlock(key);
}

void ble_notify(const uint8_t *data, size_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  uint8_t cmd[32] = {0};
  cmd[0] = INTERNAL_CMD_NOTIFY;
  memcpy(&cmd[1], data, MIN(len, sizeof(data) - 1));

  nrf_send_msg(NRF_SERVICE_BLE_MANAGER, cmd, MIN(32, len + 1), NULL, NULL);
}

void ble_set_enabled(bool enabled) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  if (!enabled) {
    ble_switch_off();
  }

  drv->enabled = enabled;

  ble_recovery_data_t data = {.version = 1, .enabled = enabled};

  backup_ram_write(BACKUP_RAM_KEY_BLE_SETTINGS, BACKUP_RAM_ITEM_PROTECTED,
                   &data, sizeof(data));
}

bool ble_get_enabled(void) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return false;
  }
  return drv->enabled;
}

static void on_ble_iface_event_poll(void *context, bool read_awaited,
                                    bool write_awaited) {
  UNUSED(context);

  syshandle_t handle = SYSHANDLE_BLE_IFACE_0;

  // Only one task can read or write at a time. Therefore, we can
  // assume that only one task is waiting for events and keep the
  // logic simple.

  if (read_awaited && ble_can_read()) {
    syshandle_signal_read_ready(handle, NULL);
  }

  if (write_awaited && ble_can_write()) {
    syshandle_signal_write_ready(handle, NULL);
  }
}

static bool on_ble_iface_read_ready(void *context, systask_id_t task_id,
                                    void *param) {
  UNUSED(context);
  UNUSED(task_id);
  UNUSED(param);

  return ble_can_read();
}

static bool on_ble_iface_check_write_ready(void *context, systask_id_t task_id,
                                           void *param) {
  UNUSED(context);
  UNUSED(task_id);
  UNUSED(param);

  return ble_can_write();
}

static const syshandle_vmt_t ble_iface_handle_vmt = {
    .task_created = NULL,
    .task_killed = NULL,
    .check_read_ready = on_ble_iface_read_ready,
    .check_write_ready = on_ble_iface_check_write_ready,
    .poll = on_ble_iface_event_poll,
};

static void on_ble_poll(void *context, bool read_awaited, bool write_awaited) {
  ble_driver_t *drv = (ble_driver_t *)context;

  UNUSED(write_awaited);

  // Until we need to poll BLE events from multiple tasks,
  // the logic here can remain very simple. If this assumption
  // changes, the logic will need to be updated (e.g., task-local storage
  // with an independent queue for each task).

  if (read_awaited) {
    irq_key_t key = irq_lock();
    bool queue_is_empty = tsqueue_empty(&drv->event_queue);
    irq_unlock(key);

    syshandle_signal_read_ready(SYSHANDLE_BLE, &queue_is_empty);
  }
}

static bool on_ble_check_read_ready(void *context, systask_id_t task_id,
                                    void *param) {
  UNUSED(context);
  UNUSED(task_id);

  bool queue_is_empty = *(bool *)param;

  return !queue_is_empty;
}

static const syshandle_vmt_t ble_handle_vmt = {
    .task_created = NULL,
    .task_killed = NULL,
    .check_read_ready = on_ble_check_read_ready,
    .check_write_ready = NULL,
    .poll = on_ble_poll,
};

bool ble_wait_until_ready(void) {
  uint32_t timeout = ticks_timeout(5000);
  ble_state_t state = {0};
  do {
    ble_get_state(&state);
    if (state.state_known) {
      return true;
    }
  } while (!ticks_expired(timeout));

  return false;
}

#endif
